app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    params[:user][:profession]
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "phone", "profession", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)